#+title: C# Notes

* Hello World!
#+begin_src csharp
public class Program {
    public static void Main(string[] args) {
        System.Console.WriteLine("Hello World!");
    }
}
#+end_src

#+RESULTS:
: Hello World!

* Exceptions
- Just like C++
- Try/Catch
- You can create your own exceptions

#+begin_src csharp
using System;
using System.IO;

class Ex {
    public static void Main(string[] args) {
        StreamReader sr;

        try {
            sr = new StreamReader("myfile.txt");
        }
        catch (Exception e) {
            Console.WriteLine(e.Message);
            return;
        }

        sr.Close();
    }
}
#+end_src

#+RESULTS:
: Could not find file "/home/jackson/jacksonmowry.github.io/cosc365/csharp/myfile.txt"

** For each
#+begin_src csharp :results verbatim
using System;

class FE {
    public static void Main(string[] args) {
        int[] a = new int[20];
        for (int i = 0; i < 20; i++) {
            a[i] = i;
        }

        foreach(int v in a) {
            Console.WriteLine(v);
        }
    }
}
#+end_src

#+RESULTS:
#+begin_example
0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
#+end_example

* Delegate
#+begin_src csharp
using System;
class D {
    public static void Main(string[] args) {
        var D = new D();

        Console.WriteLine(D.DoSomething(D.AFunction, 10, 20));
    }

    private int AFunction(int i , int j) {
        return i*j;
    }

    public delegate int Func(int i, int j);

    public int DoSomething(Func func, int i, int j) {
        return func(i, j);
    }
}
#+end_src

#+RESULTS:
: 200

* Create Our Own Classes

#+begin_src csharp :results verbatim
using System;

public class Test {
    public static void Main(string[] args) {
        Test t = new Test();
        t.Work();
        MyOther o = new MyOther();
        o.Work();
        (o as Test).Work();
    }

    virtual public void Work() {
        Console.WriteLine("do work");
    }
}

public class MyOther : Test {
    override public void Work() {
        Console.WriteLine("My think");
    }
}
#+end_src

#+RESULTS:
: do work
: My think
: My think

